Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རྒྱན་ཐམས་ཅད་དང་ལྡན་ཞིང་ཡིད་དུ་འོང་བའི་དབྱངས་ཅན་རྣམ་པར་ཐར་པ་ཡི་གེའི་འཁོར་ལོའི་རྒྱན་ལ་མཁས་པ་དང་ལྡན་པ།
en: She had a beautiful voice that had the array of all sounds. She possessed the skill of the liberation called the array of the wheel of words.

source: བཟོ་དང་གཙུག་ལག་ཐམས་ཅད་ལ་མཁས་པར་བྱུང་བ།
en: She had become skilled in all arts and treatises.

source: ཆོས་ཀྱི་ཡེ་ཤེས་སྒྱུ་མ་ལ་མཁས་པར་བསླབས་པ།
en: She had trained to become wise in illusions through Dharma wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐབས་དང་ཚུལ་རྣམ་པ་ཐམས་ཅད་དུ་ཐོབ་པ།
en: She had attained all the methods and ways of the bodhisattvas.

source: རིན་པོ་ཆེའི་ལྷབ་ལྷུབ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བརྒྱན་པའི་ལུས་ཡིད་དུ་འོང་བ་དང་ལྡན་པ།
en: She had a beautiful body adorned by various kinds of precious jewelry.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པའི་དྲ་བ་འོད་ཤིན་ཏུ་གསལ་བས་ལུས་རབ་ཏུ་བརྒྱན་པ།
en: Her body was adorned by a brightly shining network of all jewels.

source: ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་དང་། ལྷབ་ལྷུབ་གྲངས་མེད་པས་རབ་ཏུ་བརྒྱན་པས། ལུས་ཤིན་ཏུ་འབར་བ།
en: Her body shone brightly, being adorned by an array of jewelry made of countless divine precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་དམ་པ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་ཅོད་པན་ཐོགས་པ།
en: She wore tied upon her head a king of wish-fulfilling, supreme, precious jewels.

source: རིན་པོ་ཆེ་བཻ་ཌཱུརྱའི་ཕྲེང་བ་མདོ་ཟུངས་རྡོ་རྗེ་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། ནོར་བུ་རིན་པོ་ཆེ་སེང་གེ་མཛེས་པ་སྣ་ཚོགས་བཀྱེ་བ་མགུལ་ན་ཐོགས་པ།
en: She wore at her throat a string of beryl jewels with its middle adorned by diamonds, a multicolored beautiful lion, and precious jewels.

source: དགེ་བའི་རྩ་བ་སྤྱད་པ་ལ་སྐལ་བ་འཐུན་པ་དང་། སྨོན་ལམ་གཅིག་པའི་འཁོར་མང་པོ་གཞན་གྱིས་མི་ཕྱེད་ཅིང་ཡིད་དུ་འོང་བ་དང་ལྡན་པ།
en: She had a beautiful assembly of followers that could not be divided, that had a single aspiration and a similar share of the practice of the roots of merit.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོའི་གཏེར་མི་ཟད་པའི་མཛོད་དང་ལྡན་པ་འདུག་པ་མཐོང་སྟེ།
en: She possessed an inexhaustible treasury of the treasure of the great accumulations of merit and wisdom.

source: དེས་ཁྱིམ་དེ་དག་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་གནས་དང་། གཞལ་མེད་ཁང་གི་རྒྱན་དེ་དག་ཐམས་ཅད་ཀྱང་རང་གི་ལུས་ལས་བྱུང་བའི་འོད་དགའ་བར་བྱེད་པ། ལུས་བདེ་བ་དང་སིམ་པ་སྐྱེད་པ། སེམས་ཁོང་ནས་དགའ་བར་བྱེད་པས་གསལ་ཞིང་སྣང་བར་བྱས་པ་མཐོང་ངོ་། །
en: Sudhana saw that all those buildings, the entire array of precious dwellings and palaces, were illuminated and made bright by the light that came from her body, which caused delight, physical pleasure and bliss, and joy and happiness in the mind.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the courtesan Vasumitrā, stood before her with hands placed together in homage, and said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་མས་བདག་ལ་བསྟན་དུ་གསོལ། །
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདོད་ཆགས་དང་བྲལ་བའི་མཐར་ཕྱིན་པ་ཞེས་བྱ་བ་ཐོབ་སྟེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་ལྷ་རྣམས་ལ་ལྷ་མོའི་གཟུགས་དང་ཁ་དོག་དང་།
en: Vasumitrā said, “Noble one, I have attained the bodhisattva liberation called the complete attainment of freedom from desire.

source: དབྱིབས་དང་ཆུ་ཞེང་ལས་ཀྱང་ལྷག་པར་ཁ་དོག་གསལ་བ་དང་། རྣམ་པར་དག་པས་ཅི་ལ་མོས་པ་བཞིན་དུ་སྣང་བར་བྱེད་དོ། །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: “Noble one, in this way I appear to the devas in accordance with their wishes in the form, color, shape, and size of an apsaras with a brighter and purer color.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་ལ་ཡང་བུད་མེད་ཀྱི་གཟུགས་དང་། ཁ་དོག་དང་དབྱིབས་དང་།
en: In the same way, I appear in accordance with their wishes in a female form, color, shape, and size with a brighter and purer color to the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans.

source: ཆུ་ཞེང་ལྷག་པར་འོད་གསལ་ཞིང་རྣམ་པར་དག་པས་ཅི་ལ་མོས་པ་བཞིན་དུ་སྣང་བར་བྱེད་དོ། །སེམས་ཅན་གང་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་འཁོར་བའི་སེམས་དང་ལྡན་པ་དག །ཁོ་མོའི་དྲུང་དུ་འོང་ནའང་དེ་དག་ཐམས་ཅད་ལ་ཁོ་མོ་ནི་འདོད་ཆགས་དང་འབྲལ་བར་འགྱུར་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: “When beings whose minds are encircled by desire come before me, I teach all of them the Dharma so that they will become free from desire.

source: དེ་དག་གིས་ཆོས་དེ་ཐོས་ནས་ཀྱང་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་རོ། །
en: When they hear the Dharma, they attain freedom from desire.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆགས་པ་མེད་པ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །
en: They attain the bodhisattva samādhi called the realmof nonattachment.

source: ལ་ལ་ནི་ཁོ་མོ་མཐོང་མ་ཐག་ཏུ་འདོད་ཆགས་དང་བྲལ་བར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དགའ་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །ལ་ལ་ནི་གཏམ་བྱས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆགས་པ་མེད་པའི་དབྱངས་ཤེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །
en: Some become free from desire the instant they see me, and they attain the bodhisattva samādhi called joyfulness.

source: ལ་ལ་ནི་ལག་ནས་བཟུང་བ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྗེས་སུ་འགྲོ་ཞིང་གནས་པ་ཞེས་བྱ་བའང་རབ་ཏུ་འཐོབ་བོ། །
en: Some become free from desire when they hold my hand, and they attain the bodhisattva samādhi called going to and residing in all the buddha realms.

source: ལ་ལ་ནི་གཅིག་ཏུ་འགྲོགས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྲལ་བས་སྣང་བ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །
en: Some become free from desire when they are alone in my company, and they attain the bodhisattva samādhi called the light of detachment.

source: ལ་ལ་ནི་བལྟས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཞི་བའི་རྣམ་པར་བརྒྱན་ཅེས་བྱ་བ་ཡང་རབ་ཏུ་ཐོབ་བོ། །
en: Some become free from desire just by gazing upon me, and they attain the bodhisattva samādhi called the display of the form of peace.

source: ལ་ལ་ནི་གླེལ་བ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཕས་ཀྱི་རྒོལ་བ་རྣམ་པར་འཐོར་པ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །
en: Some become free from desire just by yawning, and they attain the bodhisattva samādhi called the disarraying of adversaries.

source: ལ་ལ་ནི་མྱིག་བཙུམས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཡུལ་སྣང་བ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །
en: Some become free from desire just by closing their eyes, and they attain the bodhisattva samādhi called the light of the buddha domains.

source: ལ་ལ་ནི་པང་དུ་འཁྱུད་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་འཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྡུར་ཅིང་མྱི་གཏོང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །
en: Some become free from desire just by embracing me, and they attain the bodhisattva samādhi called the essence of gathering and not abandoning all beings.

source: ལ་ལ་ནི་འོ་བྱས་པ་ཙམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་འཐོབ་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འགྲོ་བ་ཐམས་ཅད་བསོད་ནམས་ཀྱི་མཛོད་ལ་རེག་པར་བྱེད་པ་ཞེས་བྱ་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །
en: Some become free from desire just by kissing me, and they attain the bodhisattva samādhi called touching the treasure of the merit of all beings.

source: དེ་ལྟར་ཁོ་མོ་ནི་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་ཁོ་མོའི་དྲུང་དུ་འོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདོད་ཆགས་དང་བྲལ་བའི་མཐར་ཕྱིན་པ་ཐམས་ཅད་མཁྱེན་པའི་ས་ཆགས་པ་མེད་པ་ལ་མངོན་དུ་གྱུར་པ་འདི་ཉིད་ལ་རབ་ཏུ་འགོད་དོ། །
en: In that way, I establish all the beings who come to me in the bodhisattva liberation called the complete attainment of freedom from desire and the manifestation of the attachment-free level of omniscience.”

source: སྨྲས་པ། འཕགས་མ་ཁྱོད་དེ་ལྟ་བུའི་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ་དེ་ཁྱོད་ཀྱིས་དགེ་བའི་རྩ་བ་ནི་གང་དུ་བསྐྱེད།
en: Sudhana asked, “Āryā, what roots of merit did you develop?

source: ཕྲིན་ལས་ནི་ཇི་ལྟ་བུ་ཞིག་བསྩགས། སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་མོས་དྲན་ན་འདས་པའི་དུས་ཤིག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ།
en: What kinds of activities did you accumulate so that you have attained this kind of perfection?”

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤིན་ཏུ་མཐོ་བར་གཤེགས་པ་ཞེས་བ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Vasumitrā replied, “Noble one, I remember that in a past time, there had appeared in the world a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat named Atyuccagāmin.

source: དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོ་བར་གཤེགས་པ་དེ་སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་བའི་སྐུ་དོན་ཏུ་རྒྱལ་པོའི་གནས་སྒོ་བཟང་པོ་ཞེས་བྱ་བར་གཤེགས་ནས་སྒོའི་ཐེམ་པ་ལ་ཞབས་ཀྱིས་གནོན་པའི་ཚེ།
en: “The Tathāgata Atyuccagāmin, because of his love for beings, went to the capital city named Sumukhā.

source: གྲོང་ཁྱེར་དེ་ཐམས་ཅད་ཀྱང་། རབ་ཏུ་གཡོས་ནས་ཡངས་ཤིང་རྒྱ་ཆེ་ལ་རིན་པོ་ཆེ་དུ་མ་ལས་བྱས་པར་ཡོངས་སུ་གྲུབ་པར་གྱུར་ཏེ།
en: When he placed his foot upon the threshold of its gateway, the entire city shook and became huge, vast, and made of many jewels.

source: སྟེང་གི་བར་སྣང་ཡང་རིན་པོ་ཆེ་མང་པོའི་འོད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ་དང་། ལྷ་རྫས་ཀྱི་རོལ་མོ་སྣ་ཚོགས་ཀྱི་སྒྲ་རབ་ཏུ་འབྱུང་བ་དང་། ལྷའི་ལུས་ཀྱི་སྤྲིན་ཚད་མེད་པ་རྒྱ་ཆེ་བས་ཁེབས་པར་གྱུར་ཏོ། །
en: In the sky above, there was the light of a display of many jewels; it was filled with various precious flowers, emitted the sound of various divine musical instruments, and was pervaded by vast, measureless clouds of deva bodies.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ཡང་དེའི་ཚེ་ཚོང་དཔོན་གྱི་ཆུང་མ་ཞིག་ཏུ་གྱུར་ཏེ། བློ་གྲོས་བཟང་མོ་ཞེས་བྱའོ། །
en: “Noble one, at that time, I was the wife of a head merchant, and my name was Sumati.

source: དེ་ནས་ཁོ་མོ་ཆོ་འཕྲུལ་གྱིས་ཡང་དག་པར་བསྐུལ་ནས་ཁྱིམ་ཐབ་དང་ལྷན་ཅིག་ཏུ་དོང་དོང་སྟེ། དེ་བཞིན་གཤེགས་པ་གྲོང་བར་གྱི་སྲང་དུ་གཤེགས་པ་ལ་དད་པ་རྒྱ་ཆེན་པོ་སྐྱེས་ཏེ།
en: Inspired by the miracles of the Buddha, my spouse and I ran and came to the Tathāgata in a street in the middle of the city.

source: ཁོ་མོས་ནི་རིན་པོ་ཆེའི་དྲིལ་བུ་གཅིག་ཅིག་ཕུལ་ལོ། །
en: Developing a fast faith, I offered to him one precious bell.

source: དེའི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོ་བར་གཤེགས་པའི་ཞམ་འབྲིང་ན་འདུག་ཏེ།
en: “At that time, Mañjuśrī Kumāra­bhūta was an attendant of the Bhagavat, the Tathāgata Atyuccagāmin.

source: དེས་ཁོ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Through him I developed the aspiration to the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདོད་ཆགས་དང་བྲལ་བའི་མཐར་ཕྱིན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the complete attainment of freedom from desire.

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་དང་ཡེ་ཤེས་མཐའ་ཡས་པ་ལ་གནས་པ། བསོད་ནམས་རྒྱ་ཆེ་ཞིང་ཡངས་པའི་མཛོད་དང་ལྡན་པ། ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་ཐུབ་པ་མེད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of those bodhisattvas who dwell in infinite method and wisdom, who have a vast, immense treasure of merit, and who are invincible in their scope of wisdom?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བ་བ་ཡོད་དེ།
en: In this southern region there is a city called Śubhapāraṃgama.

source: དེ་ན་ཁྱིམ་བདག་ནན་ཁུགས་ཤེས་བྱ་བ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཙན་དན་གྱི་ཁྲི་འཕང་ཅན་ལ་མཆོད་པ་བྱེད་པ་ཞིག་འདུག་གིས།
en: There dwells a householder by the name of Veṣṭhila who makes offerings to a sandalwood chair that is a tathāgata shrine.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the courtesan Vasumitrā, circumambulated the courtesan Vasumitrā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the courtesan Vasumitrā.

source: ཡང་དང་ཡང་བལྟས་ཏེ། བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་གྲོང་ཁྱེར་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་ཁྱིམ་ག་ལ་བ་དེར་ཕྱིན་ནས། ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Veṣṭhila Chapter 29 Then Sudhana went to the town of Śubhapāraṃgama and approached the householder Veṣṭhila.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to his feet, stood before him, and, with his hands placed together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ནས།
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཤད་དུ་གསོལ།
en: Explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཡོངས་སུ་མི་ཟད་པ་ཐོབ་པ་སྟེ།
en: Veṣṭhila said, “Noble one, I have attained the bodhisattva liberation called the attainment of the summit of inexhaustibility.

source: རིགས་ཀྱི་བུ་ཁོ་བོའི་སེམས་ཀྱི་རྒྱུད་ལས་ནི། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ནས་ཀྱང་། སེམས་ཅན་འདུལ་བའི་དབང་དུ་མཛད་པ་མ་གཏོགས་པར་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ནས་ཀྱང་ཤིན་ཏུ་མྱ་ངན་ལས་འདས་པའི་ཚུལ་དུ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མེད་དོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མེད་དོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་མེད་དོ། །
en: “Noble one, from my mind’s viewpoint, a tathāgata has not passed into nirvāṇa, does not pass into nirvāṇa, and will not pass into nirvāṇa in any world other than as a way to bring beings who are to be guided under his control, not as a way to enter truly complete nirvāṇa.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཙན་དན་གྱི་ཁྲི་འཕང་གི་སྒོ་འབྱེད་པ་སྟེ། ཁོ་བོ་མཆོད་རྟེན་གྱི་སྒོ་འབྱེད་འབྱེད་པས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་རིགས་མི་ཟད་པའི་རྒྱན་ཅེས་བྱ་བ་ཐོབ་བོ། །
en: “Noble one, in that way, when I opened the door of the sandalwood-throne shrine of the Tathāgata, I attained, by opening the door of the shrine, the bodhisattva samādhi called the display of the unceasing family of the buddhas.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་ཏིང་ངེ་འཛིན་འདི་ཉིད་ལ་སེམས་ཀྱི་སྐད་ཅིག་སྐད་ཅིག་ཏུ་མཉམ་པར་གཞོག་སྟེ། སེམས་ཀྱི་སྐད་ཅིག་ཐམས་ཅད་ལའང་ཁྱད་པར་གྱི་རྣམ་པ་དུ་མ་རབ་ཏུ་འཐོབ་བོ། །སྨྲས་པ།
en: “Noble one, in each instant of mind I rest in this samādhi, and I attain many special features.”

source: འཕགས་པ་ཏིང་ངེ་འཛིན་དེའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས། སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོ་ཏིང་ངེ་འཛིན་འདི་ལ་སྙོམས་པར་ཞུགས་པའི་ཚེ།
en: Sudhana asked, “Ārya, what is the scope of that samādhi?”

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་འདི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པོ་བསོད་སྐྱབས་ལ་སྩོགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་། གསེར་ཐུབ་དང་། ལོག་པར་དད་སེལ་དང་། ཐམས་ཅད་མངའ་བ་དང་། གཙུག་ཏོར་ཅན་དང་། རྣམ་པར་གཟིགས་དང་། རྒྱལ་དང་།
en: Veṣṭhila replied, “Noble one, when I am resting in this samādhi, there appear to me all the tathāgatas, such as Kāśyapa, in a continuous succession of one buddha after another within the lineage of this world: all the tathāgatas such as Kanaka­muni, Krakucchanda, Viśvabhuk, Śikhin, Vipaśyin, Tiṣya, Puṣya, Yaśottara, and Padmottara.

source: རྫོགས་མཛད་དང་། གྲགས་མཆོག་དང་། པད་མོའི་བླ་ལ་སྩོགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་མཐོང་བའི་མཚམས་འབྲེལ་པས། སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་རྒྱུན་མི་འཆད་པའི་ཚུལ་གྱིས་མངོན་སུམ་དུ་མཐོང་སྟེ། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་བརྒྱ་ཡང་མཐོང་ངོ་། །
en: I see in the consecutive appearances of the buddhas the unceasing succession of one buddha after another, a hundred buddhas in one instant of mind.

source: དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་སྟོང་ཡང་མཐོང་ངོ་། །
en: In the next instant of mind I perceive a thousand buddhas.

source: དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་བརྒྱ་ཕྲག་སྟོང་ཡང་མཐོང་ངོ་། །དེ་བཞིན་དུ་སངས་རྒྱས་བྱེ་བ་དང་།
en: In the next instant of mind I perceive a hundred thousand buddhas.

source: སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དང་། སངས་རྒྱས་བྱེ་བ་དུང་ཕྱུར་དང་།
en: In the same way I see ten million buddhas, a thousand million buddhas, ten thousand million buddhas, a million million buddhas, ten million billion buddhas, ten million million billion buddhas, a hundred thousand million billion buddhas, and ten million million billion buddhas, and so on, until in a subsequent moment of mind I perceive an inexpressible number of inexpressible numbers of buddhas appearing in succession.

source: སངས་རྒྱས་བྱེ་བ་ཐམས་ཅད་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དང་། དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་འབྱུང་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་མཐོང་ངོ་། །དེའི་འོག་མའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་མཐོང་ངོ་། །
en: In the next instant of mind I see tathāgatas as numerous as the atoms in Jambudvīpa.

source: དེའི་འོག་མའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་མཐོང་སྟེ།
en: In the next instant of mind I see tathāgatas as numerous as the atoms in an inexpressible number of inexpressible numbers of buddha realms.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཐུགས་དང་པོ་བསྐྱེད་པའི་ཚོགས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལའང་འཇུག་གོ ཐུགས་དང་པོ་བསྐྱེད་པས་འཐོབ་པའི་རྣམ་པར་འཕྲུལ་པ་ལའང་འཇུག་གོ །
en: “I also perceive the successive accumulations for the first development of the aspiration to enlightenment by those tathāgatas.

source: སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་མངོན་པར་བསྒྲུབས་པ་རྣམ་པར་དག་པ་ལ་འང་འཇུག་གོ །
en: I perceive the miraculous powers they attain through their first development of the aspiration to enlightenment. I perceive their pure fulfillment of their different prayers.

source: སྤྱོད་པ་རྣམ་པར་དག་པ་ལའང་འཇུག་གོ །
en: I perceive their pure conduct.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མཛད་པ་ལའང་འཇུག་གོ །
en: I perceive their complete accomplishment of the perfections.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབས་པ་ལ་འང་འཇུག་གོ །
en: I perceive their attainment of all the bodhisattva bhūmis.

source: བཟོད་པ་བརྙེས་པ་རྣམ་པར་དག་པ་ལའང་འཇུག་གོ །
en: I perceive their pure attainment of patience.

source: བདུད་ཀྱི་དཀྲུགས་མ་རྣམ་པར་འཐོར་བའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ལའང་འཇུག་གོ །
en: I perceive their roaring that disperses the disturbances of the māras.

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ལའང་འཇུག་གོ །
en: I perceive the display of the miracles of their complete buddhahood.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པར་མཛད་པ་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །
en: I perceive the purification of their different buddha realms.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །
en: I perceive their different ripening of beings.

source: འཁོར་ཀུན་ནས་འདུས་པ་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །
en: I perceive their different gatherings of followers.

source: འོད་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །
en: I perceive their different halos of light.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ལའང་འཇུག་གོ །
en: I perceive their supremacy in turning the wheel of the Dharma.

source: སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་ལའང་འཇུག་གོ །
en: I perceive their attainment of the miraculous powers, miracles, and miraculous manifestations of buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཆོས་བསྟན་པ་ཡང་ཤིན་ཏུ་རྣམ་པར་གསལ་བ་དང་། མ་འདྲེས་པར་དྲན་ཏེ།
en: “I remember and keep the Dharma teachings of these tathāgatas clearly and distinctly.

source: ཡང་དག་པར་འཛིན་ཏོ། །དྲན་པས་ཡོངས་སུ་བཅངས་སོ། །
en: Through my memory I possess them.

source: རིག་པས་རབ་ཏུ་ཤེས་པར་བྱེད་དོ། །
en: With my intelligence I understand them.

source: བློ་གྲོས་ཀྱིས་ཤིན་ཏུ་རྣམ་པར་འབྱེད་དོ། །
en: With reverence I distinguish among them.

source: བློས་རྟོགས་པར་བྱེད་དོ། །
en: With my intellect I comprehend them.

source: ཤེས་རབ་ཀྱིས་སྣང་བར་བྱེད་དོ། །
en: With my wisdom I illuminate them.

source: མ་བྱོན་པའི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་བྱམས་པ་ལ་སྩོགས་པ་དག་ཀྱང་མཐོང་ཞིང་ཤེས་ཏེ།
en: “I also see and know the future succession of buddhas, such as Maitreya.

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་བརྒྱ་ཡང་མཐོང་ངོ་། །
en: I see a hundred buddhas in one instant of mind.

source: དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་སྟོང་ཡང་མཐོང་བ་ནས། དེའི་འོག་མའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་ཀྱང་མཐོང་སྟེ།
en: In the next instant of mind I perceive a thousand buddhas, and so on, up to the instant of mind in which I see tathāgatas as numerous as the atoms in an inexpressible number of inexpressible numbers of buddha realms.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཐུགས་དང་པོ་བསྐྱེད་པའི་ཚོགས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལའང་འཇུག་གོ །
en: “I also perceive the successive accumulations for the first development of the aspiration to enlightenment by those tathāgatas. I perceive the miraculous powers they attain through their first development of the aspiration to enlightenment.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཆོས་བསྟན་པ་ཡང་ཤིན་ཏུ་གསལ་བ་དང་།
en: I perceive their pure fulfillment of their different prayers.

source: མ་འདྲེས་པར་རྗེས་སུ་དྲན་ཏེ་ཡང་དག་པར་འཛིན་ཏོ། །
en: I perceive their pure conduct. I perceive their complete accomplishment of the perfections.

source: དྲན་པས་ཡོངས་སུ་བཅངས་སོ། །
en: I perceive their attainment of all the bodhisattva bhūmis.

source: བློ་གྲོས་ཀྱིས་རྣམ་པར་འབྱེད་དོ། །
en: I perceive their roaring that disperses the disturbances of the māras. I perceive the display of the miracles of their complete buddhahood.

source: ཇི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་འདི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐར་གཏོགས་པའི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་མཐོང་ཞིང་ཤེས་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་འདས་པ་དང་།
en: I perceive their different gatherings of followers.

source: མ་འོངས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱང་ཤེས་ཤིང་མཐོང་ངོ་། །
en: I perceive their different halos of light.

source: སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དེ་ལའང་རྒྱུན་མི་འཆད་པ་དང་།
en: “I remember and keep the Dharma teachings of these tathāgatas clearly and distinctly.

source: མི་ཟད་པ་དང་།
en: Through my memory I possess them.

source: དད་པས་ཤེས་པར་བྱ་བ་དང་།
en: With my intelligence I understand them.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་དང་།
en: With reverence I distinguish among them.

source: ཞོ་ནོན་པས་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་།
en: With my intellect I comprehend them.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱེད་པ་དང་།
en: With my wisdom I illuminate them.

source: འཇིག་རྟེན་ཐམས་ཅད་དང་།
en: “Just as I see and know the succession of buddhas in the past and in the future in the lineage of this world realm, I see and know in the lineage of world realms in the ten directions as numerous as the atoms in an inexpressible number of inexpressible numbers of buddha realms the succession of tathāgatas in the past and in the future.
